# 此為詞彙庫，請勿直接執行
#
# 如何新增詞彙庫：
# 格式：["要被轉換內容"]="目標文字" # 英文原文
#  e.x ["插件"]="外掛程式" # plugin
#      ["軟件"]="軟體"    # software
# 支援 Regex (Perl)，但若遇到括號、`|` 等 Bash 專有字元
# 請使用跳脫字元。 (ex. `\(?!檢\)視圖`)
# 若需要跳脫 `\`，則使用 `\\`
# ex. `\(` 請改成 `\\\(`
#
# 請避免在「要被轉換內容」包含 \r 符號！
#
# 保護部份只需將該字串想盡辦法不被修改即可。
# 但記得在「解除保護部份」還原成原始字串 O_O
#
# 在 glossary=() 新增好資料後，請在 glossary_order=()
# 再新增一次「要被轉換內容」，將會依照 glossary_order 從
# 上而下開始轉換。
#
# 抱歉 Orz
# 因為技術限制，所以只能先這麼做了 Orz

# 版本號碼
# 格式：[年年年年][月月][日日]-[本日修訂版]
# ex. 20190205-1
GLOSSARY_VER="20190205-6"

# 字彙資料庫
declare -A glossary=(
    # 保護部份
    
    # 轉換部份
    ["\(擴展\|\)插件"]="外掛程式" # plugin
    ["設備"]="裝置"    # device
    ["\(?!檢\)視圖"]="檢視"    # view
    ["\(?!地\)圖標\(?!記\|紀\|題\|提\|示\)"]="圖示"    # icon，排除「地圖」、和「標記/紀/題/提/示」
    ["字體"]="字型"    # font (因為 font 和 typeface 的界線已經模糊，且譯者可能會搞混其中差別。)
    ["\(?!行動\)數據\(?!機\)"]="資料"    # data，排除「行動數據」和「數據機」
    ["\(?!滑\)鼠標"]="游標"    # cursor
    ["遊標"]="游標"    # cursor
    ["組件"]="元件"    # compoment
    ["點擊\(時\|\)"]="點選"    # click
    ["\(你\|妳\)"]="您"       # you
    ["特別檔案"]="特殊檔案"    # special file
    ["相依\(性\|關係\)"]="依賴關係" # dependent
    ["相依"]="依賴"          # depend
    ["搜索"]="搜尋"          # search
    ["命令"]="指令"          # command
    ["當前"]="目前"          # current
    ["連接"]="連線"          # connect
    ["不明"]="未知"          # unknown
    ["KDE連線"]="KDE Connect " # KDE Connect
    ["KDE 連線"]="KDE Connect " # KDE Connect
    ["自定義"]="自訂"        # customize, custom
    ["剪貼板"]="剪貼簿"      # clipboard
    ["套件庫"]="軟體庫"      # repository
    ["\(高亮\|突顯\|反白\(?!顯示\)\)"]="反白顯示"      # highlight
    ["衕步"]="同步"         # sync
    ["偵錯"]="除錯"         # debug
    ["鏈結"]="連結"         # link
    ["正確安裝"]="安裝正確"  # installed properly
    
    # 復原改錯部份
    
    # 解除保護部份
)

# 順序
# 可使用此 Regex 來從 glossary 產生 glossary_order
# (需開延伸 Regex)
# s/\["(.+)"\].*/"\1"/g
declare -a glossary_order=(
    # 保護部份
    
    # 轉換部份
    "\(擴展\|\)插件"
    "設備"
    "\(?!檢\)視圖"
    "\(?!地\)圖標\(?!記\|紀\|題\|提\|示\)"
    "字體"
    "\(?!行動\)數據\(?!機\)"
    "\(?!滑\)鼠標"
    "遊標"
    "組件"
    "點擊\(時\|\)"
    "\(你\|妳\)"
    "特別檔案"
    "相依\(性\|關係\)"
    "相依"
    "搜索"
    "命令"
    "當前"
    "連接"
    "不明"
    "KDE連線"
    "KDE 連線"
    "自定義"
    "剪貼板"
    "套件庫"
    "\(高亮\|突顯\|反白\(?!顯示\)\)"
    "衕步"
    "偵錯"
    "鏈結"
    "正確安裝"
    
    # 復原改錯部份
    
    # 解除保護部份
)
